Repository: awaref/IFIN-BANKID-flutter
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: BankID App
ar: تطبيق BankID

# splashScreenLogo
source: Logo
ar: اللوجو

# languageSelectionTitle
source: Choose your language
ar: اختر لغتك

# languageEnglish
source: English
ar: الإنجليزية

# languageArabic
source: Arabic
ar: العربية

# continueButton
source: Continue
ar: متابعة

# onboardingTitle1
source: Your digital identity is secure
ar: هويتك الرقمية آمنة

# onboardingDesc1
source: Easily verify your personal identity and get comprehensive protection for all your data.
ar: تحقق بسهولة من هويتك الشخصية واحصل على حماية شاملة لجميع بياناتك.

# onboardingTitle2
source: Sign with a single touch
ar: وقّع بلمسة واحدة

# onboardingDesc2
source: Quickly sign your documents digitally with just a single touch on your screen.
ar: وقّع مستنداتك رقميًا بسرعة بمجرد لمسة واحدة على شاشتك.

# onboardingTitle3
source: Easy, secure payment
ar: دفع سهل وآمن

# onboardingDesc3
source: Enjoy fast electronic payments with high security and ease of use.
ar: استمتع بمدفوعات إلكترونية سريعة مع أمان عالٍ وسهولة استخدام.

# getStartedButton
source: Get started now
ar: ابدأ الآن

source: Add New Signature
ar: إضافة توقيع جديد

source: Signature Name
ar: اسم التوقيع

source: Enter name here
ar: أدخل الاسم هنا

source: Upload Signature File
ar: تحميل ملف التوقيع

source: Upload Images
ar: تحميل الصور

source: Delete Image
ar: حذف الصورة

source: Cancel
ar: إلغاء

source: Save Signature
ar: حفظ التوقيع

source: Verified Account
ar: حساب موثق

source: Uploaded Documents and Files
ar: المستندات والملفات المرفوعة

# scanQrCode
source: Scan the QR Code
ar: مسح رمز الاستجابة السريعة

# keepYourDigitalIdentitySecure
source: Keep your digital identity secure. Do not share it or use it at someone else's request.
ar: حافظ على هويتك الرقمية آمنة. لا تشاركها أو تستخدمها بناءً على طلب شخص آخر.

source: Home
ar: الرئيسية

source: History
ar: السجل

source: ID Card
ar: بطاقة الهوية

# idCardViewerTitle
source: ID Card Viewer
ar: عارض بطاقة الهوية

# idCardScanUsingDigitalIdApp
source: Scan using Digital ID App
ar: المسح باستخدام تطبيق الهوية الرقمية

# idCardShareViaQrCode
source: Share via QR Code
ar: المشاركة عبر رمز الاستجابة السريعة

source: Account
ar: الحساب

# nationalIdScreenTitle
source: Start with your National ID number.
ar: ابدأ برقم هويتك الوطنية.

# nationalIdNumberLabel
source: National ID Number
ar: رقم الهوية الوطنية

# nationalIdNumberHint
source: Enter 9-digits number
ar: أدخل رقمًا مكونًا من 9 أرقام

# yourPhoneNumbersTitle
source: Your Phone numbers
ar: أرقام هاتفك

# yourPhoneNumbersDescription
source: We found these numbers on your National ID. Pick one to start with it.
ar: وجدنا هذه الأرقام على هويتك الوطنية. اختر رقمًا لتبدأ به.

# pickNumberButton
source: Pick number
ar: اختر رقمًا

source: Delete
ar: حذف

source: Edit Signature
ar: تعديل التوقيع

source: Delete Signature
ar: حذف التوقيع

# areYouSureYouWantToDeleteSignature
source: Are you sure you want to delete Signature Number {number}?
ar: هل أنت متأكد أنك تريد حذف التوقيع رقم {signatureNumber}؟

source: Digital Signatures
ar: التوقيعات الرقمية

source: File added on
ar: تاريخ الإضافة

source: Settings
ar: الإعدادات

# setupPasscode
source: Setup the passcode
ar: إعداد رمز المرور

# createPinDescription
source: Create your 6-digit PIN to protect your personal data
ar: أنشئ رقم التعريف الشخصي المكون من 6 أرقام لحماية بياناتك الشخصية

source: Passcode
ar: رمز المرور

source: Set passcode
ar: تعيين رمز المرور

# accountFullName
source: Ayham Mahmoud Azeemah
ar: أيهم محمود عزيمة

# accountGenderActual
source: Male
ar: ذكر

# accountNationalityActual
source: British
ar: بريطاني

# accountIDCardImageTitle
source: ID Card Image
ar: صورة بطاقة الهوية

source: Delete Account
ar: حذف الحساب

# deleteAccountConfirmationTitle
source: Confirm Account Deletion
ar: تأكيد حذف الحساب

# deleteAccountConfirmationMessage
source: Are you sure you want to delete your account? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف حسابك؟ لا يمكن التراجع عن هذا الإجراء.

# enterPinToDeleteAccount
source: Enter your 6-digit PIN to confirm account deletion.
ar: أدخل رقم التعريف الشخصي المكون من 6 أرقام لتأكيد حذف الحساب.

# sixDigitPin
source: 6-digit PIN
ar: رقم التعريف الشخصي المكون من 6 أرقام

# pleaseEnterSixDigitPin
source: Please enter a 6-digit PIN.
ar: الرجاء إدخال رقم التعريف الشخصي المكون من 6 أرقام.

# accountDeletionSuccess
source: Account deleted successfully.
ar: تم حذف الحساب بنجاح.

source: Save changes
ar: حفظ التغييرات

# updateInformationButton
source: Update Information
ar: تحديث المعلومات

# aboutAppTitle
source: About the App
ar: حول التطبيق

# aboutAppDescription1
source: Our app is your ideal digital identity that simplifies payment and electronic signature processes. The app allows you to carry out financial transactions easily and securely, saving you time and effort. With its modern interface, you can manage your payments and sign documents anywhere, anytime. We are committed to providing a seamless user experience, where you can easily access all features. We continuously develop the app, listening to your feedback to improve performance and add new features that meet your needs. Join us today and enjoy a comprehensive digital experience that simplifies your life!
ar: تطبيق BankID هو هويتك الرقمية الآمنة. تحقق بسهولة من هويتك الشخصية واحصل على حماية شاملة لجميع بياناتك.

# aboutAppDescription2
source: We believe that technology should be accessible to everyone, so we designed the app to be user-friendly, even for new users. Additionally, the app offers multiple payment options, allowing you to choose the method that suits you best. Whether you prefer to pay via credit cards, digital wallets, or even bank transfers, we cover all options.
ar: وقّع مستنداتك رقميًا بسرعة بمجرد لمسة واحدة على شاشتك.

# aboutAppDescription3
source: We also work to enhance the security of your data through advanced encryption technologies, ensuring that your personal and financial information is fully protected. We understand that security is a top priority, so we are committed to providing a safe environment for all our users.
ar: استمتع بمدفوعات إلكترونية سريعة مع أمان عالٍ وسهولة استخدام.

# aboutAppVersion
source: V 1.0
ar: الإصدار 1.0

# accountVerifiedAccount
source: Verified Account
ar: حساب موثق

# accountNotVerified
source: Not Verified
ar: غير موثق

# accountPhoneNumber
source: Phone Number
ar: رقم الهاتف

# accountGender
source: Gender
ar: النوع

# accountMale
source: Male
ar: ذكر

# accountDateOfBirth
source: Date of Birth
ar: تاريخ الميلاد

# accountNationality
source: Nationality
ar: الجنسية

# accountBritish
source: British
ar: بريطاني

# accountNationalIdNumber
source: National ID Number
ar: رقم الهوية الوطنية

# accountDateOfIssue
source: Date of Issue
ar: تاريخ الإصدار

# accountDateOfExpiration
source: Date of Expiration
ar: تاريخ الانتهاء

# accountIDCardImage
source: ID Card Image
ar: صورة بطاقة الهوية

# appProtectionScanFingerprint
source: Scan your fingerprint to authenticate
ar: امسح بصمة إصبعك للمصادقة

# appProtectionActivateProtection
source: Activate app protection
ar: تفعيل حماية التطبيق

# appProtectionChooseOption
source: Choose the option to secure your login using the app ID
ar: اختر الخيار لتأمين تسجيل الدخول الخاص بك باستخدام معرف التطبيق

# appProtectionUseBiometrics
source: Use biometrics
ar: استخدام القياسات الحيوية

# appProtectionUseSecureWay
source: Use the ID APP in the most secure way
ar: استخدم تطبيق الهوية بأكثر الطرق أمانًا

# appProtectionSetUpPasscode
source: Set up a passcode
ar: إعداد رمز مرور

# appProtectionCreatePin
source: Create your 6-digit PIN to protect your personal data
ar: أنشئ رقم التعريف الشخصي المكون من 6 أرقام لحماية بياناتك الشخصية

# appProtectionContinue
source: Continue
ar: متابعة

# appProtectionRecommended
source: RECOMMENDED
ar: موصى به

# checkInformationTitle
source: Check your information.
ar: تحقق من معلوماتك.

# checkInformationFirstName
source: First Name
ar: الاسم الأول

# checkInformationFirstNameValue
source: AYHAM
ar: أيهم

# checkInformationLastName
source: Last Name
ar: اسم العائلة

# checkInformationLastNameValue
source: AZEEMAH
ar: عزيمة

# checkInformationGender
source: Gender
ar: النوع

# checkInformationGenderValue
source: Male
ar: ذكر

# checkInformationDateOfBirth
source: Date of Birth
ar: تاريخ الميلاد

# checkInformationNationality
source: Nationality
ar: الجنسية

# checkInformationNationalityValue
source: British
ar: بريطاني

# checkInformationNationalIdNumber
source: National ID number
ar: رقم الهوية الوطنية

# checkInformationDateOfIssue
source: Date of Issue
ar: تاريخ الإصدار

# checkInformationDateOfExpiry
source: Date of expiry
ar: تاريخ الانتهاء

# checkInformationConfirm
source: Confirm
ar: تأكيد

# twoFactorAuthenticationTitle
source: Two-Factor Authentication
ar: المصادقة الثنائية

source: Enter Confirmation Code
ar: أدخل رمز التأكيد

# confirmationCodeDescription
source: Please enter the 6-digit code sent to your registered email address.
ar: الرجاء إدخال الرمز المكون من 6 أرقام المرسل إلى عنوان بريدك الإلكتروني المسجل.

# codeLabel
source: Code
ar: الرمز

# codeHint
source: Enter code
ar: أدخل الرمز

# backButton
source: Back
ar: رجوع

# twoFactorAuthSetupAuthenticatorApp
source: Set up your authenticator app
ar: إعداد تطبيق المصادقة الخاص بك

# twoFactorAuthScanQrDescription
source: Scan the QR code below in your authenticator app and you’re all set! (If you haven’t installed an authenticator app yet.)
ar: امسح رمز الاستجابة السريعة أدناه في تطبيق المصادقة الخاص بك وأنت جاهز! (إذا لم تكن قد قمت بتثبيت تطبيق المصادقة بعد.)

# twoFactorAuthIssuer
source: Issuer
ar: المُصدر

# twoFactorAuthAccount
source: Account
ar: الحساب

# twoFactorAuthSecretKey
source: Secret Key
ar: المفتاح السري

# confirmButton
source: Confirm
ar: تأكيد

# saveOneTimeRecoveryCodeTitle
source: Save this one-time recovery code
ar: احفظ رمز الاسترداد هذا لمرة واحدة

# oneTimeRecoveryCodeDescription
source: If you lose access to your email there's a possibility you could get locked out of your account. Save this code in a safe place to use if you can't log in with your email.
ar: إذا فقدت الوصول إلى بريدك الإلكتروني، فمن المحتمل أن يتم قفل حسابك. احفظ هذا الرمز في مكان آمن لاستخدامه إذا لم تتمكن من تسجيل الدخول باستخدام بريدك الإلكتروني.

# twoFactorAuthDescription
source: Protect your account with an extra layer of security.
ar: احمِ حسابك بطبقة إضافية من الأمان.

# twoFactorAuthExplanation
source: Two-factor authentication adds an extra layer of security to your account by requiring a second form of verification in addition to your password.
ar: تضيف المصادقة الثنائية طبقة إضافية من الأمان إلى حسابك من خلال طلب شكل ثانٍ للتحقق بالإضافة إلى كلمة المرور الخاصة بك.

# enableTwoFactorAuthButton
source: Enable Two-Factor Authentication
ar: تمكين المصادقة الثنائية

# setUpAuthenticatorAppTitle
source: Set up your authenticator app
ar: إعداد تطبيق المصادقة

# setUpAuthenticatorAppDescription
source: Scan the QR code below in your authenticator app and you’re all set! (If you haven’t installed an authenticator app yet.)
ar: قم بمسح رمز QR أدناه في تطبيق المصادقة الخاص بك وستكون جاهزًا! (إذا لم تكن قد قمت بتثبيت تطبيق مصادقة بعد.)

# authenticatorDetails
source: To set up your authenticator app, scan the QR code or manually enter the following details: Issuer: {issuer} Account: {accountEmail} Secret Key: {secretKey}
ar: لإعداد تطبيق المصادقة الخاص بك، امسح رمز الاستجابة السريعة ضوئيًا أو أدخل التفاصيل التالية يدويًا: المُصدر: {issuer} الحساب: {accountEmail} المفتاح السري: {secretKey}

# contractScreenNameLabel
source: Name:
ar: الاسم:

# contractScreenIdPassportNumberLabel
source: ID/Passport Number:
ar: رقم الهوية/جواز السفر:

# contractScreenAddressLabel
source: Address:
ar: العنوان:

# contractScreenPhoneLabel
source: Phone:
ar: الهاتف:

# contractScreenEmailLabel
source: Email:
ar: البريد الإلكتروني:

# contractScreenPartyOneNameValue
source: Ahmad Khaled Mustafa
ar: أحمد خالد مصطفى

# contractScreenPartyOneAddressValue
source: Damascus – Dummar Project – Al-Yarmouk Street – Building No. 12
ar: دمشق – مشروع دمر – شارع اليرموك – بناء رقم 12

# contractScreenPartyTwoTitle
source: Party Two:
ar: الطرف الثاني:

# contractScreenPartyTwoNameValue
source: Al-Noor Modern Technologies Company (represented by Mr. Samer Abdullah)
ar: شركة النور للتقنيات الحديثة (يمثلها السيد سامر عبد الله)

# contractScreenCommercialRegistrationLabel
source: Commercial Registration:
ar: السجل التجاري:

# contractScreenPartyTwoCommercialRegistrationValue
source: 102547 – Damascus
ar: 102547 – دمشق

# contractScreenPartyTwoAddressValue
source: Damascus – Abu Rummaneh – Al-Jalaa Street – Building No. 8
ar: دمشق – أبو رمانة – شارع الجلاء – بناء رقم 8

# contractScreenIntroductionTitle
source: Contract Introduction:
ar: مقدمة العقد:

# contractScreenIntroductionDescription
source: Whereas Party One wishes to design and develop a mobile application for managing bookings, and whereas Party Two has the necessary expertise to implement this project, the parties have agreed as follows:
ar: حيث أن الطرف الأول يرغب في تصميم وتطوير تطبيق جوال لإدارة الحجوزات، وحيث أن الطرف الثاني يمتلك الخبرة اللازمة لتنفيذ هذا المشروع، فقد اتفق الطرفان على ما يلي:

# contractScreenArticleOneTitle
source: Article One – Subject of the Contract:
ar: المادة الأولى – موضوع العقد:

# contractScreenArticleOneDescription
source: Party Two (Al-Noor Modern Technologies) undertakes to design and develop a mobile application that works on both Android and iOS systems, dedicated to managing and booking appointments, according to the specifications agreed upon with Party One.
ar: يتعهد الطرف الثاني (شركة النور للتقنيات الحديثة) بتصميم وتطوير تطبيق جوال يعمل على نظامي أندرويد و iOS، مخصص لإدارة وحجز المواعيد، وذلك وفقًا للمواصفات المتفق عليها مع الطرف الأول.

# contractScreenArticleTwoTitle
source: Article Two – Duration of the Contract:
ar: المادة الثانية – مدة العقد:

# contractScreenArticleTwoDescription
source: The duration of the contract starts from 15/08/2025 for a period of three months, renewable with the written consent of both parties.
ar: تبدأ مدة العقد من تاريخ 15/08/2025 ولمدة ثلاثة أشهر، قابلة للتجديد بموافقة خطية من الطرفين.

# contractScreenArticleThreeTitle
source: Article Three – Financial Compensation:
ar: المادة الثالثة – المقابل المالي:

# contractScreenArticleThreeDescription
source: Party One commits to pay an amount of 4,500 US dollars, to be paid as follows: First payment: 2,000 dollars upon signing the contract. Final payment: 2,500 dollars upon final delivery of the project.
ar: يلتزم الطرف الأول بدفع مبلغ وقدره 4,500 دولار أمريكي، يتم دفعه على النحو التالي: الدفعة الأولى: 2,000 دولار عند توقيع العقد. الدفعة النهائية: 2,500 دولار عند التسليم النهائي للمشروع.

# contractScreenArticleFourTitle
source: Article Four – Rights and Obligations of the Parties:
ar: المادة الرابعة – حقوق والتزامات الطرفين:

# contractScreenArticleFourDescription
source: Party Two is committed to delivering the project within the specified time and according to technical standards. Party One is committed to providing all necessary information and materials for design and development in a timely manner.
ar: يلتزم الطرف الثاني بتسليم المشروع في الموعد المحدد ووفقًا للمعايير الفنية. يلتزم الطرف الأول بتقديم كافة المعلومات والمواد اللازمة للتصميم والتطوير في الوقت المناسب.

# contractScreenArticleFiveTitle
source: Article Five – Termination:
ar: المادة الخامسة – الإنهاء:

# contractScreenArticleFiveDescription
source: Either party may terminate the contract with written notice at least 15 days in advance, with payment of the financial dues to the other party according to the work completed.
ar: يجوز لأي من الطرفين إنهاء العقد بإشعار خطي قبل 15 يومًا على الأقل، مع تسوية المستحقات المالية للطرف الآخر وفقًا للعمل المنجز.

# contractScreenArticleSixTitle
source: Article Six – Governing Law:
ar: المادة السادسة – القانون الحاكم:

# contractScreenArticleSixDescription
source: This contract is subject to the laws and regulations of the Syrian Arab Republic, and any dispute shall be resolved amicably, and if that is not possible, it shall be referred to the Civil Court of Damascus.
ar: يخضع هذا العقد لقوانين وأنظمة الجمهورية العربية السورية، ويتم حل أي نزاع وديًا، وفي حال تعذر ذلك، يتم إحالته إلى المحكمة المدنية في دمشق.

# contractScreenSignaturesTitle
source: Signatures:
ar: التوقيعات:

# contractScreenSignatureLabel
source: Signature:
ar: التوقيع:

# contractScreenDateLabel
source: Date:
ar: التاريخ:

# contractScreenPartyTwoSignatureValue
source: Al-Noor Modern Technologies – Representative: Samer Abdullah
ar: شركة النور للتقنيات الحديثة – الممثل: سامر عبد الله

# contractScreenSignContractButton
source: Sign the contract
ar: توقيع العقد

# contractScreenTitle
source: Sign a contract
ar: توقيع عقد

# contractScreenPartyOneTitle
source: Party One:
ar: الطرف الأول:

# deleteAccountTitle
source: Delete account.
ar: حذف الحساب.

# deleteAccountDescription
source: Are you sure you want to delete your account? You must enter your password to confirm.
ar: هل أنت متأكد أنك تريد حذف حسابك؟ يجب عليك إدخال كلمة المرور الخاصة بك للتأكيد.

# deleteAccountPasswordLabel
source: Password
ar: كلمة المرور

# deleteAccountButton
source: Delete
ar: حذف

# fileAddedOnLabel
source: File added on
ar: تمت الإضافة في

# digitalSignaturesListTitle
source: Digital Signatures
ar: التوقيعات الرقمية

# digitalSignatureNumber
source: Digital Signature Number {number}
ar: التوقيع الرقمي {number}

# addNewSignatureButton
source: Add New Signature
ar: إضافة توقيع جديد

# editPhoneNumberTitle
source: Edit Phone Number
ar: تعديل رقم الهاتف

# editPhoneNumberLabel
source: Phone Number
ar: رقم الهاتف

# cancelButton
source: Cancel
ar: ًإلغاء

# authenticatorAppTitle
source: Authenticator App
ar: تطبيق المصادقة

# authenticatorAppDescription
source: Use an authenticator app to generate a one-time code.
ar: استخدم تطبيق المصادقة لإنشاء رمز لمرة واحدة.

# emailOptionTitle
source: Email
ar: البريد الإلكتروني

# emailOptionDescription
source: Receive an email with one-time code.
ar: استقبل رمزًا لمرة واحدة عبر البريد الإلكتروني.

# setupAuthenticatorAppTitle
source: Set up your authenticator app
ar: إعداد تطبيق المصادقة الخاص بك

# setupAuthenticatorAppDescription
source: Scan the QR code below in your authenticator app and you’re all set! (If you haven’t installed an authenticator app yet.)
ar: امسح رمز الاستجابة السريعة أدناه في تطبيق المصادقة الخاص بك وأنت جاهز! (إذا لم تكن قد قمت بتثبيت تطبيق المصادقة بعد.)

# issuerLabel
source: Issuer:
ar: الناشر:

# accountLabel
source: Account:
ar: الحساب:

# secretKeyLabel
source: Secret Key:
ar: المفتاح السري:

# noInternetConnectionTitle
source: No internet connection
ar: لا يوجد اتصال بالإنترنت

# noInternetConnectionDescription
source: Please check your internet connection and try again.
ar: يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.

# retryButton
source: Retry
ar: إعادة المحاولة

# noResultsFoundTitle
source: No results found
ar: لم يتم العثور على نتائج

# noResultsFoundDescription
source: No results found for "{searchQuery}". Please try another search.
ar: لم يتم العثور على نتائج لـ "{searchQuery}". يرجى تجربة بحث آخر.

# searchHint
source: Search
ar: بحث

# historyItemIdentity
source: Identity
ar: الهوية

# historyItemSignature
source: Signature
ar: التوقيع

# historyItemSwishAtSeb
source: Swish at SEB
ar: Swish في SEB

# historyItemMinimumApplicationDate
source: Minimum application - date
ar: الحد الأدنى لتاريخ التطبيق

# historyItemApplicationIdKort
source: Application ID-Kort
ar: تطبيق بطاقة الهوية

# userName
source: Ayham Mahmoud Azeemah
ar: أيهم محمود عزيمة

# homeScreenUserName
source: Ayham Mahmoud Azeemah
ar: أيهم محمود عزيمة

# homeScreenVerifiedAccount
source: Verified Account
ar: حساب موثق

source: Enter Verification code.
ar: أدخل رمز التحقق.

# verificationCodeSentTo
source: Verification code has been sent to
ar: تم إرسال رمز التحقق إلى

source: Verification code
ar: رمز التحقق

# resendSmsWithin
source: You can resend the SMS within
ar: يمكنك إعادة إرسال الرسالة النصية خلال

source: Retry Verification
ar: إعادة محاولة التحقق

source: Let's create your ID App identity.
ar: لنقم بإنشاء هوية تطبيق الهوية الخاص بك.

source: Performing this process
ar: إجراء هذه العملية

source: for fun or as a test
ar: للمتعة أو كاختبار

# mayResultInPermanentBlock
source: may result in you being permanently blocked and can prohibit you from using ID App.
ar: قد يؤدي إلى حظرك بشكل دائم ويمنعك من استخدام تطبيق الهوية.

source: Follow these steps
ar: اتبع هذه الخطوات

source: Take a selfie video.
ar: التقط فيديو سيلفي.

source: Take a photo of your National ID card
ar: التقط صورة لبطاقة الهوية الوطنية الخاصة بك

source: Start Enrollment
ar: بدء التسجيل

# onTheNextScreenFollowInstructions
source: On the next screen, follow the instructions to record a selfie.
ar: في الشاشة التالية، اتبع التعليمات لتسجيل سيلفي.

# pleaseNoteSurroundingsVisible
source: Please note that your surroundings will be visible while taking the selfie
ar: يرجى ملاحظة أن محيطك سيكون مرئيًا أثناء التقاط صورة السيلفي

# tryMovingToBetterLighting
source: Try moving to an area with better lighting and remove your glasses or anything else covering your face
ar: حاول الانتقال إلى منطقة ذات إضاءة أفضل وإزالة نظارتك أو أي شيء آخر يغطي وجهك

source: Take a selfie
ar: التقط سيلفي

source: Take a picture of your National ID card.
ar: التقط صورة لبطاقة الهوية الوطنية الخاصة بك.

source: Please Ensure:
ar: يرجى التأكد:

# usingCorrectNationalIdCard
source: You are using the correct National ID Card
ar: أنت تستخدم بطاقة الهوية الوطنية الصحيحة

# nationalIdCardWithinScanningFrame
source: The National ID Card is within the scanning frame and is fully visible
ar: بطاقة الهوية الوطنية ضمن إطار المسح ومرئية بالكامل

# fingersDontCoverNationalId
source: Your Fingers don’t cover any part of the National ID
ar: لا تغطي أصابعك أي جزء من بطاقة الهوية الوطنية

# imageClearWithoutGlare
source: The image is clear without any glare or shadows
ar: الصورة واضحة بدون أي وهج أو ظلال

source: Take a Picture
ar: التقط صورة

source: Sign a contract
ar: توقيع عقد

source: You can sign a contract from here
ar: يمكنك توقيع عقد من هنا

source: Scan the QR Code
ar: امسح رمز الاستجابة السريعة

# keepDigitalIdentitySecure
source: Keep your digital identity secure. Do not share it or use it at someone else's request.
ar: حافظ على هويتك الرقمية آمنة. لا تشاركها أو تستخدمها بناءً على طلب شخص آخر.

source: Search
ar: بحث

source: Identity
ar: الهوية

source: Signature
ar: التوقيع

source: Code copied to clipboard
ar: تم نسخ الرمز إلى الحافظة

# copyCodeButton
source: Copy Code
ar: نسخ الرمز

# doneButton
source: Done
ar: تم

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية

# privacyPolicyDescription
source: This is the privacy policy description.
ar: هذا هو وصف سياسة الخصوصية.

# privacyPolicyInfoCollectTitle
source: Information Collection
ar: جمع المعلومات

# privacyPolicyInfoCollectDescription
source: We collect various types of information when you use our app.
ar: نقوم بجمع أنواع مختلفة من المعلومات عند استخدامك لتطبيقنا.

# privacyPolicyHowToUseTitle
source: How We Use Your Information
ar: كيف نستخدم معلوماتك

# privacyPolicyHowToUseDescription
source: Your information is used to provide and improve our services.
ar: تُستخدم معلوماتك لتقديم خدماتنا وتحسينها.

# privacyPolicyInfoProtectionTitle
source: Information Protection
ar: حماية المعلومات

# privacyPolicyInfoProtectionDescription
source: We implement a variety of security measures to maintain the safety of your personal information.
ar: نحن نطبق مجموعة متنوعة من الإجراءات الأمنية للحفاظ على سلامة معلوماتك الشخصية.

# privacyPolicyYourRightsTitle
source: Your Rights
ar: حقوقك

# privacyPolicyYourRightsDescription
source: You have the right to access, correct, or delete your personal data.
ar: لديك الحق في الوصول إلى بياناتك الشخصية أو تصحيحها أو حذفها.
