Repository: awaref/IFIN-BANKID-flutter
Catalog: lib/l10n/app_*.arb
Languages: ar

# termsOfUseTitle
source: Terms of Use
ar: شروط الاستخدام

# termsOfUseDescription
source: This is the terms of use description.
ar: هذا هو وصف شروط الاستخدام.

# termsOfUseAcceptance
source: Acceptance of Terms
ar: قبول الشروط

# termsOfUseRegistration
source: Registration and Account
ar: التسجيل والحساب

# termsOfUsePermittedUse
source: Permitted Use
ar: الاستخدام المسموح به

# termsOfUseSecurity
source: Security
ar: الأمان

# termsOfUseChanges
source: Changes to Terms
ar: تغييرات على الشروط

# authenticateReason
source: Scan your fingerprint (or face or other biometric) to authenticate
ar: امسح بصمة إصبعك (أو وجهك أو أي مقياس حيوي آخر) للمصادقة

# authenticationError
source: Error -
ar: خطأ -

# authorizedStatus
source: Authorized
ar: مصرح به

# notAuthorizedStatus
source: Not Authorized
ar: غير مصرح به

# settingsTitle
source: Settings
ar: الإعدادات

# generalSettingsTitle
source: General Settings
ar: الإعدادات العامة

# appFingerprintTitle
source: App Fingerprint
ar: بصمة التطبيق

source: Turn Off
ar: إيقاف

source: Turn On
ar: تشغيل

# appLanguageTitle
source: App Language
ar: لغة التطبيق

# helpAndSupportTitle
source: Help & Support
ar: المساعدة والدعم

# aboutTheAppTitle
source: About the App
ar: حول التطبيق

# accountSettingsTitle
source: Account Settings
ar: إعدادات الحساب

# changePasswordTitle
source: Change Password
ar: تغيير كلمة المرور

# transactionHistoryTitle
source: Transaction History
ar: سجل المعاملات

# idCardTitle
source: ID Card
ar: بطاقة الهوية

# idCardSubtitle
source: Manage your digital ID card
ar: إدارة بطاقة الهوية الرقمية الخاصة بك

# newAccountSectionTitle
source: New Account
ar: حساب جديد

# addNewAccountTitle
source: Add New Account
ar: إضافة حساب جديد

# updateInformationTitle
source: Update Information
ar: تحديث المعلومات

# firstNameLabel
source: First Name
ar: الاسم الأول

# lastNameLabel
source: Last Name
ar: اسم العائلة

# genderLabel
source: Gender
ar: الجنس

# dateOfBirthLabel
source: Date of Birth
ar: تاريخ الميلاد

# nationalityLabel
source: Nationality
ar: الجنسية

# dateOfIssueLabel
source: Date of Issue
ar: تاريخ الإصدار

# dateOfExpiryLabel
source: Date of Expiry
ar: تاريخ الانتهاء

source: Enter PIN Code
ar: أدخل رمز PIN

# pinCodeDescription
source: Please enter your 6-digit PIN to proceed.
ar: الرجاء إدخال رمز PIN المكون من 6 أرقام للمتابعة.

# incorrectPin
source: Incorrect PIN. Please try again.
ar: رمز PIN غير صحيح. الرجاء المحاولة مرة أخرى.

source: Verify
ar: تحقق

# issuer
source: Social Flow
ar: التدفق الاجتماعي
